app/controllers/lists_controller.rb

  def create
    @list = current_user.lists.new(params[:list])
    if @list.save
---
INSERT INTO "lists" ("name", "created_at", "updated_at", "user_id") VALUES('primer lista!', '2009-11-07 20:55:49', '2009-11-07 20:55:49', NULL)

  def show
    @list = List.find(params[:id])
---
SELECT * FROM "lists" WHERE ("lists"."id" = 2)

  def edit
    @list = List.find(params[:id])
---
SELECT * FROM "lists" WHERE ("lists"."id" = 4)

  def update
    @list = List.find(params[:id])
    if @list.update_attributes(params[:list])
---
SELECT * FROM "lists" WHERE ("lists"."id" = 4)
UPDATE "lists" SET "updated_at" = '2009-11-07 22:01:26', "name" = 'despues de hablar con Lu!' WHERE "id" = 4

  def destroy
    @list = List.find(params[:id])
    @list.destroy
---
SELECT * FROM "lists" WHERE ("lists"."id" = 5)
DELETE FROM "lists" WHERE "id" = 5