app/controllers/tasks_controller.rb

  def new
    @list = List.find(params[:list_id])
---
SELECT * FROM "lists" WHERE ("lists"."id" = 2)

  def create
    @list = List.find(params[:list_id])
    @task = @list.tasks.new(params[:task])
    if @task.save
---
SELECT * FROM "lists" WHERE ("lists"."id" = 2)
INSERT INTO "tasks" ("created_at", "title", "completed", "updated_at", "list_id") VALUES('2009-11-08 04:02:44', 'task1', 'f', '2009-11-08 04:02:44', 2)

  def edit
    @task = Task.find(params[:id])
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 2)

  def update
    @task = Task.find(params[:id])
    if @task.update_attributes(params[:task])
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 2)
UPDATE "tasks" SET "updated_at" = '2009-11-08 16:53:57', "title" = 'task!', "completed" = 't' WHERE "id" = 13

  def destroy
    @task = Task.find(params[:id])
    @task.destroy
---
SELECT * FROM "tasks" WHERE ("tasks"."id" = 1)
DELETE FROM "tasks" WHERE "id" = 1