app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "password_salt", "persistence_token", "login", "email") VALUES('2009-11-07 04:43:06', '149de3bbe9917293a106ffb1ed11ddc2257c4e58cb4cdc587e8984b645247d0119fd60fe89ffa19c966e7406589482ff700f452b83cb22f503e622f99fd7e13d', '2009-11-07 04:43:06', 'I3xBkLOK2V2aPach6kGV', 'b211b0956bf15e448759dcc2046b209b90a717d8d1a398dbfe92d2e88fde528675030fcaa63bd03e2aab974a7f28274beff0542368603259daa7e48fd133636c', 'emancu', 'emancu@grid.com')
---
  def create
    @user = User.new(params[:user])
    if @user.save

UPDATE "users" SET "persistence_token" = 'be54b96ca617ba089e2d3016045077969191beb56a8ecfbc7581fea280506677e96163cc2b11970814799d6d9de02a1cb8b953b6ab23cf0ce1161ab2dfef3ab0', "updated_at" = '2009-11-07 20:28:10', "email" = 'emiliano@grid.com', "password_salt" = 'ouO_TbsFjAChWWUDBIp0', "crypted_password" = '1e02c628ee6522e8b6c6a520994113c6b7abc6f4706d847e90771cdfb6107c713784631c76a94b45bcfb680885ab234cfc9f705acf53e2e8f3aa46be2f99b0b7' WHERE "id" = 2
---
  def update
    @user = @current_user
    if @user.update_attributes(params[:user])